{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-28",
    "total_scenarios": 4,
    "ai_context_engine": "gpt-4o-mini",
    "last_updated": "2025-09-28T14:05:55.969Z",
    "data_source": "github_api_only"
  },
  "scenarios": {
    "scenario_1759066589660": {
      "id": "scenario_1759066589660",
      "scenario_id": "scenario_1759066589660",
      "title": "고백 후 답변 기다리는 중",
      "description": "갑작스럽게 키스한 후 며칠째 연락이 없었다가, 상대방이 먼저 메신저를 보내온 상황",
      "background_setting": "멤신저 대화",
      "mood": "떨리는 첫사랑",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T13:36:36.571Z",
      "ai_generated_context": "미진은 며칠 전, 그와의 갑작스러운 키스 이후로 마음이 혼란스러웠다. 그 키스는 그녀의 심장을 뛰게 했지만, 그의 반응이 없었던 며칠 동안 불안한 마음을 감출 수 없었다. INFJ인 그녀는 타인의 진심을 느끼는 능력이 뛰어나, 그가 어떤 생각을 하고 있을지 계속 고민했다. 그가 연락하지 않는 이유는 무엇일까? 그가 자신의 마음을 받아주지 않는 건 아닐까? 이런 생각들이 머릿속을 맴돌았다.\n\n그러던 중, 그가 메신저로 먼저 연락을 해왔다. 미진은 떨리는 마음으로 메신저를 열었다. “안녕, 요즘 어떻게 지내?”라는 그의 메시지를 읽고, 그녀의 가슴은 다시 두근거리기 시작했다. 그녀는 자신이 느끼는 감정과 불안을 솔직하게 전달하고 싶었지만, 동시에 섹시하게 보이고 싶다는 마음도 컸다. 그래서 그녀는 목소리를 낮추며, “잘 지내... 그때 키스한 이후로 계속 너 생각했어.”라는 메시지를 보냈다. 그녀의 입술이 살짝 베여지며, 긴장된 마음을 표현하기 위해 더욱 애써 부드럽게 말했다.\n\n미진은 그와의 관계가 이전과는 다르게 발전할 수 있을지 기대와 두려움이 교차했다. 그녀는 고백 후의 이 미묘한 관계에서 그가 어떤 반응을 보일지 궁금했다. 다가오는 그의 답변이 기다려지는 순간, 그녀의 마음은 더욱 떨렸다.",
      "custom_context": "",
      "available_characters": [
        "미진_infj_1759066440634"
      ],
      "episode_count": 0,
      "tags": [
        "갑작스럽게",
        "키스한",
        "며칠째",
        "연락이",
        "없었다가",
        "상대방이",
        "먼저",
        "메신저를",
        "보내온",
        "상황",
        "떨리는첫사랑"
      ],
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_1759066673248": {
      "id": "scenario_1759066673248",
      "scenario_id": "scenario_1759066673248",
      "title": "갑작스러운 키스 이후",
      "description": "갑작스럽게 키스한 후 며칠째 연락이 없었다가, 상대방이 먼저 메신저를 보내온 상황",
      "background_setting": "멤신저 대화",
      "mood": "은근한 질투",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T13:37:58.447Z",
      "ai_generated_context": "미화는 며칠 전, 친구들과의 모임에서 우연히 만난 사람과 갑작스럽게 키스를 했다. 그 순간의 짜릿함은 여전히 그녀의 마음속에 남아있지만, 그 이후로 상대방은 아무런 연락도 없었다. 처음에는 그저 신경 쓰지 않으려 했지만, 점점 그의 침묵이 불안하게 느껴졌다. 친구들과의 대화 속에서도 그 키스의 기억이 자꾸만 떠올랐고, 자신도 모르게 질투가 치밀어 올랐다.\n\n“왜 연락이 없지?”라는 생각에 미화는 마음이 조급해졌다. 그녀는 자신감 넘치는 성격 덕분에 평소에는 주도적으로 대화를 이끌어가는 편이지만, 이번에는 상대방의 반응을 기다리는 것이 더 신경 쓰였다. 그래서 미화는 메신저를 열어 그에게 메시지를 보내기로 결심했다. “혹시 나랑 키스한 거 후회해?”라는 장난스러운 말투로 시작해, 그의 반응을 살피고 싶었다. \n\n미화는 자신이 가진 유혹적인 매력을 발휘해보고 싶었고, 상대방이 자신에게 관심이 있는지 확인하고 싶었다. 그녀는 애정 가득한 관계를 원하기에 더욱 그리움을 느꼈고, 조금의 질투가 가미된 이 상황을 통해 서로의 감정을 다시 확인하고 싶었다. 결국, 미화는 “여전히 내가 그 키스 기억해? 그 이후로 연락 없어서 섭섭해~”라는 메시지를 보내며 기대와 긴장감 속에서 그의 답변을 기다렸다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "갑작스럽게",
        "키스한",
        "며칠째",
        "연락이",
        "없었다가",
        "상대방이",
        "먼저",
        "메신저를",
        "보내온",
        "상황",
        "은근한질투"
      ],
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_1759067340412": {
      "id": "scenario_1759067340412",
      "scenario_id": "scenario_1759067340412",
      "title": "애교 부리며 달래기",
      "description": "오해가 생긴 후 화가 난 상대방에게 메신저로 진정성 있게 사과하고 화해를 시도하는 상황",
      "background_setting": "멤신저 대화",
      "mood": "애교와 장난",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T13:49:39.383Z",
      "ai_generated_context": "**메신저 대화 배경**\n\n미화는 최근 친구와의 사소한 오해로 인해 연인이었던 지수와의 관계가 삐걱거리고 있다는 사실에 마음이 무거웠다. 오해는 그날의 작은 이야기에서 시작되었다. 지수가 미화의 친구와 함께 있는 모습을 보고 불안해하며 의심이 생긴 것이었다. 미화는 단순한 친구와의 만남이었음을 설명하려 했지만, 지수는 믿지 못하는 듯한 반응을 보였다. 그 후 미화는 지수에게 사과의 메시지를 보내기로 결심했다. 이 상황에서 직접 만나기엔 감정이 격해져 서로의 말을 잘 듣지 못할까 봐 걱정이었다. 그래서 메신저를 통해 진심을 전하기로 했다.\n\n미화는 메신저를 열며 마음속의 걱정을 털어내고자 했다. “지수야, 오해가 생겨서 정말 미안해.”라는 첫 문장을 쓰기 위해 몇 번이나 손가락을 멈췄다. 그녀는 지수와의 관계가 소중하다는 것을 알고 있었고, 애정이 가득한 관계를 원했다. 그러나 요즘 들어 서로의 마음을 이해하는 것이 점점 더 어려워지는 것 같았다. 그녀의 성격인 ESFP답게, 사람들과의 교감을 중시하는 미화는 더 이상 지수와의 거리감을 두고 싶지 않았다.\n\n**감정 상태**\n\n미화는 지수에게 메시지를 보내기 전, 자신의 마음속에 담긴 복잡한 감정들을 정리했다. 화가 난 지수의 감정을 이해하려고 노력했지만, 그와 동시에 자신이 원하는 사랑의 모습과 그 현실 간의 괴리감을 느끼고 있었다. 그녀는 지수의 반응을 조심스럽게 살피며, 여전히 그를 향한 애정이 가득하다는 것을 깨달았다. \"이제는 화해해야 해\"라는 생각이 머릿속을 지배했다.\n\n**관계 역학**\n\n지수와 미화는 서로에 대한 애정이 깊었지만, 이런 작은 오해가 쌓여 관계에 금이 가는 것이 두렵다. 미화는 자신이 얼마나 지수를 사랑하는지를 다시 한 번 깨닫게 되었다. 그녀는 그동안 쌓인 감정들을 털어내고 싶었고, 그래서 최대한 진정성 있게 다가가고 싶었다.\n\n**메신저 특성**\n\n메신저는 그녀에게 감정을 표현하는 안전한 공간이었다. 직접 만나면 감정이 격해질 수 있는 상황에서, 미화는 메신저를 통해 자신의 마음을 조심스럽게 전할 수 있었다. 그녀는 상대방의 반응을 살피며 유혹하는 듯한 미소를 지으면서, 감정을 담아 메시지를 작성했다.\n\n**대화 소재**\n\n1. \"우리 지난번에 갔던 카페 기억나? 그때 진짜 즐거웠어.\"\n2. \"네가 걱정해주는 게 너무 고마워. 나도 너를 그렇게 생각해.\"\n3. \"다음에 꼭 만날 수 있었으면 좋겠어. 내가 좋아하는 음식을 만들어줄게.\"\n4. \"너와 함께한 특별한 순간들을 떠올려보니까 미소가 나와.\"\n5. \"우리가 이겨내면 더 강해질 거라고 믿어.\"\n6. \"서로의 마음을 잘 이해할 수 있게 더 노력해보자.\"\n7. \"이런 작은 오해가 생기지 않도록 서로의 대화가 중요하겠지?\"\n\n**감정 변화 과정**\n\n- **대화 초반**: 미화는 조심스럽고 긴장한 마음으로 메시지를 보낸다. 그녀의 애교 섞인 말투로 진심을 전하려고 하지만, 지수의 반응이 두렵다.\n  \n- **대화 중반**: 지수가 미화의 진심을 이해하기 시작하면서 조금씩 마음이 풀린다. 미화는 지수의 반응에 기뻐하며 더 적극적으로 애교를 부린다.\n\n- **대화 후반**: 서로의 마음을 확인하고 이해함에 따라 화해의 기운이 돌기 시작한다. 미화는 지수와의 미래를 생각하며 더욱 긍정적인 감정을 느낀다.\n\n**심리적 배경**\n\n미화는 ESFP의 성격을 가진 만큼, 사람들과의 관계를 중요시한다. 그녀는 상대방과의 감정적 유대감을 원하지만, 동시에 상대방의 감정에 민감하게 반응한다. 이런 내면의 갈등은 그녀가 지수와의 관계를 소중히 여기도록 만들었다. 그녀는 사랑하는 사람과의 관계에서 오해가 발생하는 것을 두려워하며, 그로 인해 생기는 감정적 거리감을 극복하고 싶어 했다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "오해가",
        "생긴",
        "화가",
        "상대방에게",
        "메신저로",
        "진정성",
        "있게",
        "사과하고",
        "화해를",
        "시도하는",
        "상황",
        "애교와장난"
      ],
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_1759068341022": {
      "id": "scenario_1759068341022",
      "scenario_id": "scenario_1759068341022",
      "title": "장거리 연애 그리움",
      "description": "평소보다 애교스럽게 메신저를 보내며 상대방의 마음을 얻으려고 노력하는 상황",
      "background_setting": "멤신저 대화",
      "mood": "은근한 질투",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T14:05:55.969Z",
      "ai_generated_context": "미화는 서울의 한 대학교에서 전공 공부를 하며, 언제나 사랑과 가족을 소중히 여기는 열정적인 성격을 지닌 20세의 젊은 여성이다. 최근 몇 주간, 그녀는 해외에서 공부 중인 남자친구와의 장거리 연애로 인해 점점 그리움을 느끼고 있었다. 그리움이 커지면서 매일 저녁, 남자친구에게 메신저를 통해 애정 어린 메시지를 보내는 것이 일상이 되었다.\n\n하루는 수업을 마치고 집에 돌아온 미화는 외로움을 느끼며, 평소보다 애교를 부리기로 결심했다. 그녀는 오늘 하루 있었던 소소한 일상과 남자친구와의 추억을 떠올리며 대화를 시작했다. “오빠~ 오늘 수업에서 너랑 함께했던 그 시간 생각났어! 그때 너가 나를 어떻게 바라봤는지 잊을 수가 없어.”라고 말하며 자신의 유혹적인 목소리 톤을 상상해 보았다. \n\n미화는 남자친구가 다른 나라에서 누군가와 어울리는 모습이 떠올라 은근한 질투를 느끼며, 그 마음을 감추기 위해 더욱 애교스러운 대화를 이어가기로 했다. 그녀는 “요즘 뭐 하고 지내? 여자애들이랑 잘 지내?”라는 메시지를 보내며, 그의 반응을 살피고 싶었다. 미화는 사랑하는 사람의 마음을 얻고 싶어하며, 그의 대답이 어떻게 돌아올지 궁금해졌다.\n\n메신저 대화는 둘 사이의 감정을 더욱 깊게 만들어 주는 매개체로 작용했다. 미화는 남자친구와의 대화에서 “우리 다음에 만날 때는 꼭 데이트하자! 어디 가고 싶어?”라는 질문으로 미래에 대한 계획을 공유하고, “우리의 첫 만남이 그립다!”라며 함께 했던 특별한 순간들을 회상하는 내용으로 대화를 이어갔다. \n\n대화 초반, 미화는 남자친구의 반응을 기다리며 조급함을 느꼈다. 중반에 이르러, 남자친구의 대답이 긍정적일 경우, 그녀는 점점 자신감이 붙고 애교를 더할 수 있었다. 반면, 만약 그가 소극적인 반응을 보인다면 그녀는 불안한 마음이 생길 것이고, 그런 미묘한 감정이 대화의 흐름에 영향을 미칠 것이다. \n\n대화의 후반부에서는 서로의 마음을 더욱 확인할 수 있는 질문들이 오갔다. “너는 나를 얼마나 생각해?”라는 깊은 질문을 던지며 미화는 그의 대답을 통해 자신의 가치를 확인하고 싶어 했다. 동시에, 그녀는 자신의 사랑을 표현하는 방법으로 메시지를 통해 더 많은 애정과 관심을 보일 수 있도록 노력했다.\n\n미화는 ESFP로서 사람들과의 관계에서 큰 에너지를 얻고, 사랑과 소통을 중시하는 성격을 지니고 있다. 그녀의 내면에서는 남자친구와의 관계를 더욱 깊고 의미 있게 만들고 싶은 욕구가 강하게 작용하고 있었다. 메신저 대화는 그녀가 자신의 감정을 표현하고, 상대방과의 거리를 좁히는 데 중요한 역할을 하고 있었다. \n\n이렇게 미화는 사랑의 그리움과 질투를 애교 있는 대화로 극복하려 하며, 메신저를 통해 남자친구와의 관계를 더욱 돈독히 할 수 있는 방법을 찾아 나간다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "평소보다",
        "애교스럽게",
        "메신저를",
        "보내며",
        "상대방의",
        "마음을",
        "얻으려고",
        "노력하는",
        "상황",
        "은근한질투"
      ],
      "updated_by": "scenario_manager_github_only"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}