{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-16",
    "total_scenarios": 1,
    "ai_context_engine": "claude-3.5-sonnet",
    "reset_at": "2025-09-27T01:23:46.586Z",
    "reset_reason": "Clean scenarios data reset",
    "last_updated": "2025-09-28T11:53:42.896Z"
  },
  "scenarios": {
    "scenario_1759059028079": {
      "id": "scenario_1759059028079",
      "scenario_id": "scenario_1759059028079",
      "title": "첫 눈이 내린 날",
      "description": "비 오는 날 우산을 함께 쓰게 된 두 사람의 설레는 만남",
      "background_setting": "벚꽃이 만발한 공원",
      "mood": "현실적",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T11:30:39.293Z",
      "ai_generated_context": "**제목: 첫 눈이 내린 날**\n\n서울의 공원은 봄을 맞이하여 벚꽃이 만발해 있었다. 따사로운 햇살이 나뭇잎 사이로 비치고, 사람들의 웃음소리가 어우러지는 가운데, 미화는 친구들과 함께 즐거운 시간을 보내고 있었다. 그러나 갑자기 하늘이 어두워지더니, 비가 내리기 시작했다. 미화는 그 순간, 자유롭고 감성적인 마음으로 친구들에게 이렇게 말했다. \"야, 비가 오네! 신기하지 않아? 어떠니?\" 그녀는 둥근 눈을 반짝이며 웃었고, 그 모습은 주위 사람들을 매료시켰다.\n\n그때, 공원 한쪽에서 우산을 들고 있던 남자와 시선이 마주쳤다. 그 남자는 미화의 화려한 모습에 감명을 받았다. 미화는 잠시 주저하다가 그에게 다가가서 우산을 함께 쓰자고 제안했다. \"야, 우산 같이 쓸래? 비 오는 날은 이렇게 함께하는 게 더 재밌어!\" 그녀는 말끝을 살짝 늘이며 숨소리를 섞어 말했다.\n\n두 사람은 우산 아래에서 가까워졌다. 미화는 남자의 얼굴을 바라보며 속으로 설렘을 느꼈다. \"정말 아름답다,\" 남자가 말했다. 미화는 그의 말에 더욱 밝은 미소를 지으며 \"그렇지? 이렇게 비 오는 날은 특별해,\"라고 대답했다. \n\n비가 내리는 소리가 배경 음악처럼 흐르는 가운데, 미화의 마음은 떨림으로 가득 차 있었다. 그녀는 친구들과의 우정만큼이나 소중한 순간이란 것을 깨달았다. 남자와의 대화는 자연스러웠고, 서로의 눈빛에서 끌림을 느꼈다. \"야, 너는 어떤 취미가 있어?\" 미화는 물었다. 그 질문은 단순한 호기심이 아니라, 그와의 관계를 더 깊게 만들고 싶다는 마음에서 비롯되었다.\n\n남자는 자신의 취미를 이야기하며 미화의 관심을 끌었고, 그들은 우산 아래에서 서로의 세계를 공유하며 점점 가까워졌다. 미화는 그 순간이 자신의 자유와 연애 사이에서 균형을 잡아주는 것처럼 느꼈다. \"어떻게 이렇게 우연히 만날 수 있지?\" 그녀는 속으로 생각하며, 설레는 마음을 감추지 못했다.\n\n비가 내리는 날, 두 사람의 만남은 특별한 의미로 남았다. 미화는 자신이 남자와의 관계에서 새로운 가능성을 발견하고 있음을 느끼며, 우정과 사랑 사이에서 더 큰 행복을 찾고자 했다. 첫 눈이 내린 날, 그들은 서로에게 잊지 못할 기억을 남기게 되었다.",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759057439348"
      ],
      "episode_count": 0,
      "tags": [
        "오는",
        "우산을",
        "함께",
        "쓰게",
        "사람의",
        "설레는",
        "만남",
        "현실적"
      ],
      "updated_by": "scenario_manager"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}