{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-28",
    "total_scenarios": 3,
    "ai_context_engine": "gpt-4o-mini",
    "last_updated": "2025-09-28T16:02:54.938Z",
    "data_source": "github_api_only"
  },
  "scenarios": {
    "scenario_1759073172435": {
      "id": "scenario_1759073172435",
      "scenario_id": "scenario_1759073172435",
      "title": "고백 후 답변 기다리는 중",
      "description": "고백한 후 답변을 기다리고 있는데, 상대방이 신중하게 메신저로 마음을 표현하려는 상황",
      "background_setting": "멤신저 대화",
      "mood": "은근한 질투",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T15:26:29.734Z",
      "ai_generated_context": "**메신저 대화 배경**\n\n미화는 최근에 한 친구와의 만남에서 오랜 감정을 털어놓기로 결심했다. 그 친구는 그녀와 오랜 시간동안 친하게 지냈던 상대였고, 서로의 마음을 알아가는 과정 속에서 미화는 자신이 그를 좋아하고 있다는 사실을 깨달았다. 그래서 그녀는 용기를 내어 그의 마음을 고백했다. 하지만 고백이 끝난 후, 그 친구는 당혹스러운 반응을 보였고, \"잠시 생각해볼게\"라는 대답을 남긴 채 그녀에게서 멀어졌다. \n\n이제 미화는 메신저를 통해 그의 답변을 기다리고 있다. 그녀는 직접 만나서 얘기하기 어려운 마음의 혼란을 조금이나마 덜기 위해 메신저로 대화를 시도하려 한다. 그녀의 성격인 ESFP는 감정 표현이 풍부하고, 사람들과의 교류를 즐기지만, 지금은 그가 자신의 마음을 어떻게 받아들일지에 대한 불안감으로 가득 차 있다. \n\n현재 미화는 그에게 보내고 싶은 메시지를 고민하면서, 그가 어떻게 반응할지에 대한 상상을 하며 마음이 복잡해진다. \"내가 너무 서두른 건 아닐까?\"라는 생각이 그녀의 머릿속을 가득 채운다. 그러나 동시에 \"그가 나를 어떻게 생각할까?\"라는 궁금증이 그녀를 자극하고 있다. \n\n**대화 소재 제안**\n1. 그가 최근에 본 영화나 드라마에 대한 이야기\n2. 함께 했던 특별한 순간에 대한 회상\n3. 서로의 취미에 대한 이야기 (예: 음악, 여행)\n4. 최근에 일어난 일상적인 사건에 대한 공유\n5. 미래 계획에 대한 이야기 (여행, 목표 등)\n6. 서로의 가치관에 대한 깊은 대화\n7. 미묘한 감정을 탐색하는 질문들 (예: 너는 나를 어떻게 생각해?)\n\n**감정 변화 과정**\n- 대화 초반: 미화는 불안과 기대가 뒤섞인 감정으로 시작한다. \"그가 나를 좋아하지 않으면 어쩌지?\"라는 걱정이 가득하다.\n- 대화 중반: 그가 긍정적인 반응을 보이면 미화는 안도와 기쁨을 느끼게 되고, 더욱 솔직한 대화를 이어갈 가능성이 높아진다.\n- 대화 후반: 그의 반응이 예상보다 긍정적이라면 미화는 자신감을 얻고, 두 사람의 관계가 더욱 깊어질 수 있는 가능성을 느끼게 된다.\n\n**심리적 배경**\n미화는 ESFP로서 사람들과의 관계를 중시하고, 감정적인 교류를 원한다. 그녀는 자신의 마음을 솔직하게 표현하는 것에 대한 두려움과 기대가 동시에 존재하고 있다. 고백 후 그 친구의 신중한 반응에 대한 불안감이 커지면서, 자신의 매력과 가치를 다시금 되돌아보게 된다. 또한, 그녀는 상대방의 마음을 이해하고 싶어 하는 욕구가 강해, 메신저를 통해서라도 그의 생각과 감정을 알고 싶어 한다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "고백한",
        "답변을",
        "기다리고",
        "있는데",
        "상대방이",
        "신중하게",
        "메신저로",
        "마음을",
        "표현하려는",
        "상황",
        "은근한질투"
      ],
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_1759074626974": {
      "id": "scenario_1759074626974",
      "scenario_id": "scenario_1759074626974",
      "title": "갑작스러운 키스 이후",
      "description": "갑작스럽게 키스한 후 며칠째 연락이 없었다가, 상대방이 먼저 메신저를 보내온 상황",
      "background_setting": "멤신저 대화",
      "mood": "서운한 마음",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T15:50:44.986Z",
      "ai_generated_context": "**메신저 대화 배경: 갑작스러운 키스 이후**\n\n며칠 전, 미화는 친구들과의 파티에서 예기치 않게 상대방과의 키스를 경험했다. 그 순간, 감정의 물결이 밀려와서 서로의 마음이 통한다고 느꼈지만, 이후 연락이 없자 미화는 서운함과 혼란스러운 감정을 느끼기 시작했다. 그녀는 그 키스가 단순한 순간의 열정이 아니길 바랐지만, 상대방의 침묵은 그녀의 마음을 더욱 흔들리게 만들었다. \n\n미화는 항상 자신감 넘치고 유혹적인 매력을 가진 인물로, 상대방의 반응을 살피는 것을 즐겼다. 하지만 이 상황에서는 그 반응이 없는 것이었다. 그래서 며칠째 연락이 없던 그가 갑자기 메신저로 먼저 메시지를 보내온 상황은 미화에게 기대와 긴장감을 동시에 불러일으켰다.\n\n**감정 상태:**\n미화는 그 메시지를 받고 혼란스러운 마음을 감추지 못했다. 자신이 느끼는 서운함과 불안감은 그녀의 마음 속에서 얽히고설켜 있었다. 상대방이 무엇을 생각하고 있는지 궁금하면서도, 그녀가 그에게서 듣고 싶은 말은 무엇인지 명확하지 않았다. 이제 그녀는 그와의 관계에 대한 불확실성으로 인해 더욱 긴장하고 있었다.\n\n**관계 역학:**\n두 사람은 키스 이후 서로의 감정을 확인할 기회를 놓쳤고, 이제는 서로의 마음을 탐색해야 하는 상황에 놓였다. 미화는 그 키스가 단순한 우연이 아니길 바라지만, 그가 어떤 의도를 가지고 있는지를 알고 싶었다. 그래서 이번 메신저 대화는 그들의 관계의 미래를 결정짓는 중요한 순간이 될 수 있었다.\n\n**메신저 특성:**\n직접 만나서 이 복잡한 감정을 이야기하기 어려운 상황이었기 때문에, 메신저는 서로의 감정을 솔직하게 표현할 수 있는 좋은 방법이 되었다. 미화는 감정을 정리할 수 있는 시간을 가질 수 있었고, 상대방에게 직접적으로 다가가지 않더라도 마음을 전할 수 있다는 점에서 메신저의 장점을 느꼈다.\n\n**대화 소재:**\n1. “그날 키스는 정말 놀라웠어. 네 생각은 어땠어?”\n2. “그 이후로 계속 네가 생각났어. 잘 지냈어?”\n3. “우리 다시 만나서 이야기해보는 건 어때?”\n4. “사실 그날 이후로 좀 서운했어. 너는 어땠어?”\n5. “우리 앞으로 어떻게 할까? 서로의 마음을 확인해보고 싶어.”\n6. “우리가 함께 했던 순간들을 다시 떠올려보면 좋을 것 같아.”\n7. “이번 주말에 시간 어때? 얼굴 보고 이야기해보고 싶어.”\n\n**감정 단계:**\n- **대화 초반:** 미화는 긴장과 설렘이 교차하며, 상대방의 첫 메시지에 대한 기대감으로 가득 차 있다.\n- **대화 중반:** 서로의 감정을 확인하는 과정에서 미화는 서운함이 드러나기 시작하고, 상대방의 반응에 따라 더 깊은 감정을 공유할지 고민하게 된다.\n- **대화 후반:** 감정이 정리되고, 서로의 진솔한 마음을 확인함에 따라 미화는 안도감과 함께 앞으로의 관계에 대한 희망을 가지게 된다.\n\n**심리 분석:**\n미화는 ESFP의 성격으로, 감정적이고 사람들과의 관계를 중시한다. 그녀는 사랑과 가족을 가치로 두고 있으며, 상대방과의 진솔한 소통을 통해 관계의 깊이를 느끼고 싶어한다. 그녀는 상대방이 자신의 마음을 이해해주길 바라며, 키스 이후의 침묵은 그녀에게 불안과 서운함을 동시에 안겼다. 하지만 메신저를 통해 이 불확실성을 해소하고, 서로의 마음을 확인하는 과정을 통해 관계가 더욱 발전할 수 있기를 바라고 있다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "갑작스럽게",
        "키스한",
        "며칠째",
        "연락이",
        "없었다가",
        "상대방이",
        "먼저",
        "메신저를",
        "보내온",
        "상황",
        "서운한마음"
      ],
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_갑작스러운_키스_이후_1759075360727": {
      "id": "scenario_갑작스러운_키스_이후_1759075360727",
      "scenario_id": "scenario_갑작스러운_키스_이후_1759075360727",
      "title": "갑작스러운 키스 이후",
      "description": "고백한 후 답변을 기다리고 있는데, 상대방이 신중하게 메신저로 마음을 표현하려는 상황",
      "background_setting": "멤신저 대화",
      "mood": "은근한 질투",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T16:02:54.938Z",
      "ai_generated_context": "**상황 제목: 갑작스러운 키스 이후**\n\n**상황 배경**: 미화는 서울의 한 카페에서 오랜 친구와의 만남을 마치고 집으로 돌아가는 길이었다. 이날 친구와의 대화 중 우연히 연애에 대한 이야기가 나왔고, 미화는 그 순간 자신이 평소 생각해왔던 사람과의 관계에 대한 갈망이 더욱 커졌음을 느꼈다. 그 사람은 바로 최근에 자주 만나게 된 친구, 수현이었다. 미화는 수현과의 첫 키스가 머릿속을 떠나지 않았다. 그 키스는 완벽했고, 순간적으로 모든 것이 멈춘 듯한 기분이었다. 하지만 키스 이후 수현이 어떻게 느끼고 있는지 궁금해지기 시작했다. 그리하여 미화는 수현에게 메신저로 간단한 메시지를 보내기로 결심했다.\n\n**감정 상태**: 미화는 수현에게 자신의 마음을 전한 후, 그에 대한 답변을 기다리는 마음이 복잡했다. 자신감 넘치는 성격 덕분에 키스에 대한 기대감과 설렘이 가득했지만, 동시에 수현이 자신을 어떻게 생각하는지에 대한 불안감도 함께 했다. 미화는 자신의 감정이 수현에게 전달되길 바라면서도, 그가 신중하게 생각하는 모습을 이해하려는 마음이 있었다. 그녀는 자신이 얼마나 수현을 좋아하는지를 깨닫게 되었고, 그 감정이 서로를 향한 질투의 감정으로 이어질 수도 있다는 걱정이 들었다.\n\n**관계 역학**: 미화와 수현은 서로에 대한 호감이 있었지만, 그 관계는 아직 애매한 상태였다. 미화는 수현이 그녀에게 어떤 감정을 품고 있는지 확신할 수 없었고, 수현 역시 자신의 마음을 드러내는 데 신중할 것이라는 생각이 들었다. 이런 복잡한 감정 속에서 미화는 수현의 반응을 살피고, 그에 맞춰 자신의 감정을 조절하고 싶어 했다.\n\n**메신저 특성**: 직접 만나서 말하기 어려운 이유는 미화가 수현에게 직접적으로 감정을 표현하기에는 두려움이 있었기 때문이다. 메신저를 통해 감정을 나누는 것이 그녀에게는 더 안전하고 편안한 방법으로 느껴졌다. 메신저 대화는 서로의 마음을 조금 더 자연스럽고 여유롭게 확인할 수 있는 기회를 제공했다.\n\n**대화 소재**:\n1. “오늘 카페에서 친구와 이야기하면서 네 생각이 많이 났어.”\n2. “우리 키스, 진짜 갑작스러웠지만 좋았어. 너는 어땠어?”\n3. “혹시 나에 대한 너의 생각은 어떤지 궁금해.”\n4. “다음에 같이 할 수 있는 특별한 계획 있어?”\n5. “요즘 즐기는 취미나 관심사는 뭐야?”\n6. “우리가 함께한 기억 중 가장 특별한 순간은 언제였지?”\n7. “너와 나의 미래에 대해 생각해본 적 있어?”\n\n**감정 단계**:\n- **초반**: 미화는 설렘과 두려움이 교차하는 상태로 대화를 시작한다. 수현의 반응을 기다리며 두근거림을 느낀다.\n- **중반**: 수현의 답변에 따라 미화의 감정이 조금씩 변화한다. 긍정적인 반응이 오면 행복감을 느끼고, 부정적인 반응이 오면 불안감이 커진다.\n- **후반**: 대화가 진행되면서 서로의 마음을 확인하고, 미화는 수현과의 관계에 대한 희망을 갖게 된다. 질투의 감정이 희미해지며 서로에 대한 신뢰가 쌓인다.\n\n**심리 분석**: ESFP인 미화는 사람들과의 관계에서 즐거움과 감정을 중요시하는 성격이다. 그러나 키스 이후 수현의 반응을 기다리는 동안, 그녀는 불안과 질투의 감정을 동시에 느끼게 된다. 미화는 자신의 마음을 솔직하게 드러내고 싶지만, 그로 인해 관계가 어색해질까 두려워한다. 이 과정에서 미화는 수현이 자신의 감정을 어떻게 받아들일지에 대한 복잡한 심리를 겪게 된다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "은근한 질투"
      ],
      "source": "scenario_admin",
      "updated_by": "scenario_manager_github_only"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}