{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-16",
    "total_scenarios": 3,
    "ai_context_engine": "claude-3.5-sonnet",
    "reset_at": "2025-09-27T01:23:46.586Z",
    "reset_reason": "Clean scenarios data reset",
    "last_updated": "2025-09-28T12:13:23.421Z",
    "data_source": "github_api_only"
  },
  "scenarios": {
    "scenario_1759059148800": {
      "id": "scenario_1759059148800",
      "scenario_id": "scenario_1759059148800",
      "title": "벚꽃이 흩날리던 순간",
      "description": "동아리 MT에서 처음 만난 선후배가 특별한 감정을 느끼게 되는 이야기",
      "background_setting": "학교 축제 현장",
      "mood": "따뜻함",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T11:32:41.741Z",
      "ai_generated_context": "제목: 벚꽃이 흩날리던 순간\n\n봄바람이 부드럽게 불어오는 날, 학교 축제 현장은 화려한 꽃들로 가득했다. 벚꽃이 만개한 나무 아래, 미화는 친구들과 함께 즐거운 시간을 보내고 있었다. 긴 생머리를 바람에 날리며, 둥근 눈을 반짝이게 한 채 친구들에게 이야기하고 있었다. \"얘들아, 저기 저 벚꽃 아래서 사진 한 장 찍을까? 어떠니?\" 화려하고 감성적인 말투로 제안하자 친구들은 고개를 끄덕였다. 미화는 그들 사이에서 가장 자유롭고 활기찬 존재였다.\n\n사진을 찍기 위해 벚꽃 나무 아래로 다가가던 중, 한 선배와 눈이 마주쳤다. 그 선배는 미화의 친구들과 함께 있던 인물로, 차분한 성격과 진지한 표정이 인상적이었다. 미화는 즉시 그에게 윙크를 하며 인사했다. \"안녕, 선배야! 여기서 뭐해?\" 그 순간, 미화의 마음속에 작은 떨림이 일었다. 선배는 미화의 화려한 표정에 잠시 멈칫하다가, 부드러운 미소를 지으며 대답했다. \"축제 준비 중이야. 너희도 즐거운 시간 보내고 있니?\"\n\n그들의 대화는 간단했지만, 미화는 그 순간이 특별하다는 것을 느꼈다. 선배의 진중한 태도와 따뜻한 미소가 그녀의 마음에 스며들었다. \"우리 같이 사진 찍자!\" 미화는 친구들을 부르며 선배에게 제안했다. 선배는 당황한 듯했지만, 미화의 제안에 수긍하며 함께 사진을 찍기로 했다.\n\n사진을 찍고 나서 미화는 선배와 좀 더 가까운 대화를 나누고 싶다는 마음이 커졌다. \"선배야, 앞으로도 축제 같은 이벤트에서 자주 만나면 좋겠어. 어떠니?\" 미화는 화려한 어휘를 사용하며 말을 이었다. 선배는 미화의 에너지에 끌려서, 그녀의 말에 살짝 미소 지었다. \"좋아, 다음에는 우리 같이 계획 세워보자.\"\n\n미화는 그 순간, 이 작은 만남이 더 큰 우정으로 이어질 수 있기를 바랐다. 친구들과의 우정도 소중했지만, 그날의 따뜻한 감정이 선배와의 특별한 인연으로 발전하기를 희망했다. 벚꽃이 흩날리는 그 순간, 미화의 마음은 설렘으로 가득 차올랐다.",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759057439348"
      ],
      "episode_count": 0,
      "tags": [
        "동아리",
        "mt에서",
        "처음",
        "만난",
        "선후배가",
        "특별한",
        "감정을",
        "느끼게",
        "되는",
        "이야기",
        "따뜻함"
      ],
      "updated_by": "scenario_manager"
    },
    "scenario_1759060461705": {
      "id": "scenario_1759060461705",
      "scenario_id": "scenario_1759060461705",
      "title": "도서관의 속삭임",
      "description": "도서관에서 우연히 같은 책을 읽고 있던 두 사람이 조금씩 가까워지는 과정",
      "background_setting": "중앙 도서관",
      "mood": "달콤함",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T11:54:31.361Z",
      "ai_generated_context": "제목: 도서관의 속삭임\n\n중앙 도서관의 3층, 조용한 구석자리에서 미화는 책을 읽고 있었다. 긴 생머리가 조명을 받아 부드러운 윤기를 내며, 둥근 눈은 책의 내용을 따라 반짝였다. 그녀의 캐주얼한 옷차림은 자연스러운 매력을 더했다. 도서관의 은은한 조명 아래, 그녀는 그 책에 몰입해 있었다.\n\n“그래서, 뭐하고 놀까?” 미화는 마음속으로 질문을 던졌다. 언제나 친구들과의 따뜻한 관계를 소중히 여기던 그녀는 오늘도 새로운 인연을 갈망하고 있었다. 그때, 책장을 넘기는 소리에 시선이 끌렸다. 바로 옆자리에서 같은 책을 읽고 있는 남자가 있었다. \n\n미화는 자신의 마음속에 피어나는 설렘을 느끼며, 그에게 시선을 주었다. 남자는 책의 내용을 진지하게 읽고 있었지만, 그녀의 시선을 느꼈는지 가벼운 미소를 지었다. 미화는 그 미소에 가슴이 두근거렸다. 그녀는 다시 책으로 시선을 돌리며, “어때?”라는 말버릇이 입가에서 맴돌았다. \n\n잠시 후, 그녀는 용기를 내어 남자에게 말을 걸기로 결심했다. “저도 그 책 좋아하는데, 어떻게 생각해요?” 그녀의 목소리는 유혹적이고 쾌활했다. 남자는 놀란 듯 고개를 들며 미화에게 답했다. “재미있네요. 특히 주인공의 선택이…” 그들의 대화는 자연스럽게 이어졌다. 미화는 그의 진솔한 의견을 듣고, 더욱 매력을 느꼈다.\n\n시간이 흐를수록 두 사람은 서로의 이야기에 빠져들었다. 미화는 자신의 감정 표현이 풍부한 성격 덕분에 대화가 즐거웠고, 남자도 그녀의 에너지에 끌렸다. 도서관의 조용한 분위기 속에서 그들의 웃음소리는 은은하게 울려 퍼졌다.\n\n마음속에 품고 있던 따뜻한 가치관, 사랑과 가족에 대한 이야기를 나누며, 미화는 그와의 연결고리가 깊어지는 것을 느꼈다. 서로의 눈을 바라보며 주고받는 작은 미소가 점점 더 달콤한 긴장감을 만들어갔다. \n\n“다음에는 같이 이 책 읽고, 다른 이야기도 나눌까요?” 미화의 제안에 남자는 환하게 웃었다. “좋아요. 그러면 더 많은 이야기를 나눌 수 있겠네요.” \n\n중앙 도서관의 속삭임 속에서 시작된 그들의 이야기는, 미래의 소중한 기억으로 남게 될 것임을 두 사람 모두 느꼈다.",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759060402670"
      ],
      "episode_count": 0,
      "tags": [
        "도서관에서",
        "우연히",
        "같은",
        "책을",
        "읽고",
        "있던",
        "사람이",
        "조금씩",
        "가까워지는",
        "과정",
        "달콤함"
      ],
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_1759061586175": {
      "id": "scenario_1759061586175",
      "scenario_id": "scenario_1759061586175",
      "title": "마지막 여름날",
      "description": "과제를 함께 하면서 서로를 알아가는 팀원들의 로맨스",
      "background_setting": "야간 캠퍼스",
      "mood": "코믹",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T12:13:23.421Z",
      "ai_generated_context": "**제목: 마지막 여름날**\n\n여름의 끝자락, 서울의 한 대학 캠퍼스에서 미진은 과제를 위해 친구들과 모였다. 저녁 해가 지고 나면 서늘한 바람이 불어오는 이 시간, 캠퍼스의 나무 아래에서 그들은 앉아 있었다. 미진은 긴 생머리를 바람에 흩날리며, 둥근 눈으로 친구들의 반응을 살폈다. \"그래서... 이 부분은 우리가 어떻게 할까?\" 미진은 과제를 진행하며 자연스럽게 표정을 지으며 웃음을 터트렸다.\n\n그녀의 ESTJ 성격은 팀원들에게 리더십을 발휘하게 했다. \"음.. 이 자료는 너무 부족해. 우리가 추가해야 할 것 같아,\" 그녀는 주저하지 않고 의견을 제시했다. 친구들은 그녀의 자신감 넘치는 모습에 힘을 얻어, 하나둘씩 아이디어를 내기 시작했다. 미진은 그들의 반응을 보며, 가끔씩 웃음이 터져 나오는 자신을 발견했다. \n\n그날의 하늘은 파랗고, 점점 어두워지는 캠퍼스의 분위기는 코믹한 긴장감으로 가득 차 있었다. 미진은 순간의 설렘을 느끼며, 친구들과의 유대가 깊어지는 것을 실감했다. \"그래서... 우리, 이런 걸로 해보자!\" 그녀가 제안할 때마다, 팀원들은 그녀의 열정에 감화되어 더 많은 아이디어를 쏟아냈다. \n\n한편, 미진은 자신도 모르게 누군가에게 끌리기 시작했다. 그건 같은 팀의 남학생, 진호였다. 그의 진지한 표정과 자신감 넘치는 모습이 마음에 남았던 것이다. \"그래서... 진호, 네 생각은 어때?\" 그녀가 그에게 질문을 던질 때마다, 그의 반응을 지켜보는 것이 즐거웠다. 진호는 미소를 지으며 \"음.. 좋은 생각이야,\"라고 대답했고, 그 순간 미진은 가슴이 두근거리는 것을 느꼈다.\n\n캠퍼스의 조명이 하나둘 켜지며, 그들의 대화는 더 활기를 띄었다. 미진은 사랑과 우정, 그리고 가족을 소중히 여기는 가치관 덕분에, 팀원들과의 유대감을 더욱 깊게 느꼈다. 이 여름날이 지나가기 전에, 그들은 서로의 마음을 조금씩 알아가는 중이었다. 그리고 미진의 마음속에서 피어나는 감정은, 앞으로의 모든 여름날을 특별하게 만들어 줄 것임을 깨달았다. \n\n\"그래서, 다음 주에 다시 만나서 이어서 하자!\" 미진이 제안하자, 팀원들은 서로의 눈빛을 교환하며 미소 지었다. 그 순간, 마지막 여름날이 그들의 마음에 오래도록 기억될 것임을 확신하게 했다.",
      "custom_context": "",
      "available_characters": [
        "미진_estj_1759061539044"
      ],
      "episode_count": 0,
      "tags": [
        "과제를",
        "함께",
        "하면서",
        "서로를",
        "알아가는",
        "팀원들의",
        "로맨스",
        "코믹"
      ],
      "updated_by": "scenario_manager_github_only"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}