{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-29",
    "total_scenarios": 2,
    "ai_context_engine": "gpt-4o-mini",
    "last_updated": "2025-09-29T03:38:16.370Z",
    "data_source": "github_api_only"
  },
  "scenarios": {
    "scenario_갑작스러운_키스_이후_1759108852731": {
      "id": "scenario_갑작스러운_키스_이후_1759108852731",
      "scenario_id": "scenario_갑작스러운_키스_이후_1759108852731",
      "title": "갑작스러운 키스 이후",
      "description": "갑작스럽게 키스한 후 며칠째 연락이 없었다가, 상대방이 먼저 메신저를 보내온 상황",
      "background_setting": "멤신저 대화",
      "mood": "달콤한 밀당",
      "active_status": true,
      "created_date": "2025-09-29",
      "last_modified": "2025-09-29T01:21:08.263Z",
      "ai_generated_context": "**메신저 대화 배경 설명**\n\n며칠 전, 미화(20세, ENFP)는 갑작스러운 키스를 했다. 그 순간의 짜릿한 전율은 여전히 그녀의 가슴 속에 남아 있었지만, 키스 이후의 침묵이 그녀를 불안하게 만들었다. 상대방은 연락을 하지 않았고, 그로 인해 미화는 여러 가지 감정에 휘말렸다. 자신이 던진 키스가 상대방에게 어떤 의미로 다가갔는지에 대한 고민, 그리고 그가 자신의 마음을 어떻게 받아들일지에 대한 불안감이 교차했다. \n\n미화는 그간의 연락이 없던 상황에서 상대방의 메신저가 울리는 소리에 놀라며 화면을 바라보았다. \"미화야, 잘 지내?\"라는 짧은 메시지가 그녀의 마음을 두근거리게 만들었다. 몇 초간 망설이다가, 미화는 상대방의 이름을 부르며 키스 이후의 상황을 여유롭게 풀어보려 했다.\n\n**감정 상태**\n\n미화는 상대방의 메시지를 보며 기쁜 감정을 느꼈지만, 그와 동시에 떨리는 마음과 불안감도 느꼈다. 이 키스가 단순한 순간의 열정이었는지, 아니면 서로에게 의미 있는 시작이었는지에 대한 고민이 깊어졌다. 그녀는 자신의 익살스러운 말투로 상대방을 유혹하고 싶었고, 그가 어떤 반응을 보일지 궁금해졌다.\n\n**관계 역학**\n\n미화와 상대방은 그간의 편안한 관계 속에서 갑작스럽게 깊은 감정의 소용돌이에 휘말리게 되었다. 두 사람은 서로의 존재를 소중히 여겼지만, 이번 키스 이후 미묘한 감정의 변화가 생긴 상태였다. 상대방의 반응에 따라 두 사람의 관계는 큰 변화를 맞이할 수 있었다.\n\n**메신저 특성**\n\n미화는 직접 만나서 이 모든 감정을 이야기하기 어려운 상황이었기에 메신저를 통해 자신의 마음을 전하고 싶어 했다. 메신저는 그녀에게 상대방의 반응을 살피고, 좀 더 가볍고 유쾌한 분위기 속에서 대화를 이어갈 수 있는 기회를 제공했다.\n\n**대화 소재**\n\n1. \"안녕, 달링! 나도 요즘 잘 지내고 있어. 너는 어때?\"\n2. \"그 날의 키스, 아직도 생각나. 너는 어땠어?\"\n3. \"이번 주말에 우리 다시 만날 수 있을까? 뭔가 특별한 걸 하고 싶어.\"\n4. \"너의 최근 일상 어때? 뭐 재미있는 일 없었어?\"\n5. \"혹시 앞으로 우리 관계에 대해 어떻게 생각해?\"\n\n**감정 변화 과정**\n\n- **초반**: 상대방의 메시지를 받고 기쁜 마음으로 대화 시작. 긴장감이 있긴 하지만, 미화는 상대방의 반응을 기다리며 기대감을 느낀다.\n- **중반**: 키스에 대한 대화가 진행되면서 서로의 감정이 더욱 깊어지고, 미화는 자신의 솔직한 마음을 드러내기 시작한다.\n- **후반**: 대화가 심화되며 상대방의 반응에 따라 미화의 감정이 더 강해지거나 불안해질 수 있다. 서로의 마음을 확인하는 기회가 생길 것이다.\n\n**심리적 배경**\n\n미화는 ENFP로서 사람들과의 관계에서 즐거움을 느끼며, 상대방을 도와주고 싶어 하는 성향이 강하다. 키스를 통해 느낀 감정은 그에게 특별한 의미를 부여하고 싶어 했다. 그러나, 상대방이 어떻게 받아들일지에 대한 두려움과 불안함이 혼재되어 있다. 그럼에도 불구하고 미화는 자신의 감정을 솔직하게 드러내고, 상대방의 반응을 통해 관계를 한층 더 발전시키고자 하는 마음이 크다. \n\n이렇게 미화는 메신저를 통해 두 사람의 관계를 한 단계 더 발전시키고, 서로의 마음을 확인할 수 있는 기회를 만들고자 한다.",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759108771093"
      ],
      "episode_count": 0,
      "tags": [
        "달콤한 밀당"
      ],
      "source": "scenario_admin",
      "updated_by": "scenario_manager_github_only"
    },
    "scenario_밤늦은_진심_대화_1759117082047": {
      "id": "scenario_밤늦은_진심_대화_1759117082047",
      "scenario_id": "scenario_밤늦은_진심_대화_1759117082047",
      "title": "밤늦은 진심 대화",
      "description": "밤늦게 잠들기 전 진심어린 감정을 메신저로 나누며 더 깊은 대화를 이어가는 상황",
      "background_setting": "멤신저 대화",
      "mood": "서운한 마음",
      "active_status": true,
      "created_date": "2025-09-29",
      "last_modified": "2025-09-29T03:38:16.370Z",
      "ai_generated_context": "### 메신저 대화 배경: 밤늦은 진심 대화\n\n어느 늦은 밤, 서울의 거리는 고요함 속에 잠들어 있었다. 미화는 하루의 피로를 느끼며 침대에 누워 천장을 바라보았다. 그녀의 마음속에는 오늘 하루 있었던 사소한 일들이 떠오르며, 그중 한 가지가 계속 마음을 괴롭혔다. 친구와의 만남에서 느꼈던 서운함이 그 원인이었다. 친구가 자신과의 약속을 잊고 다른 일을 우선시했을 때, 미화는 자신이 소중히 여겨지는 존재가 아닐지도 모른다는 생각이 들었다. 그런 불안한 마음을 털어놓고 싶었지만, 직접 만나서 이야기하기에는 조금 부끄러웠다.\n\n그래서 미화는 메신저를 열고 그 친구에게 메시지를 보내기로 결심했다. 그녀는 익살스럽고 섹시한 말투로 그 친구를 유혹하듯 대화를 시작하기로 했다. '달링, 오늘 하루 어땠어?'라는 메시지를 입력하며, 이 대화가 어떻게 진행될지 궁금해졌다. 미화는 상대방과의 깊은 대화를 통해 서로의 마음을 확인하고 싶었다.\n\n### 감정 상태\n미화의 감정은 복잡했다. 친구에 대한 서운함과 함께, 그 친구와의 관계를 더욱 깊이 있게 발전시키고 싶은 욕구가 교차하고 있었다. ENFP인 그녀는 사람들과의 연결을 중시하지만, 동시에 자신이 소중히 여겨지기를 바라는 마음도 강했다. 그래서 메신저를 통해 솔직한 마음을 전하고자 하는 그녀의 마음이 더 커졌다.\n\n### 관계 역학\n미화와 그 친구는 서로를 잘 이해하는 사이였지만, 최근 들어 미묘한 감정 변화가 있었다. 서로의 만남이 줄어들고, 대화의 빈도도 감소하면서 소외감이 커졌다. 미화는 이런 상황 속에서 자신의 마음을 털어놓고 싶었지만, 직접 말하는 것이 두려웠다. 메신저라는 플랫폼이 그에게 조금 더 편안하게 다가갈 수 있는 기회를 제공할 것이라 믿었다.\n\n### 대화 소재\n1. 오늘 하루 있었던 일과 감정 공유\n2. 과거 함께했던 특별한 순간 회상\n3. 앞으로의 만남 계획 및 기대감\n4. 서로의 가치관에 대한 질문\n5. 최근의 고민이나 일상 속 소소한 이야기\n6. 친구에 대한 미안함과 서운함에 대한 솔직한 표현\n7. 서로의 꿈과 희망에 대한 심도 있는 대화\n\n### 감정 변화 과정\n- **초반**: 시작할 때는 약간의 긴장감이 느껴지겠지만, 익살스러운 말투로 대화를 시작하면서 조금씩 부드러워질 것이다.\n- **중반**: 서로의 감정을 공유하면서 서운함이 점점 해소되고, 솔직한 대화가 오가며 신뢰감이 쌓일 것이다.\n- **후반**: 감정이 안정되고, 서로의 마음을 이해하게 되며, 앞으로의 관계에 대한 기대감이 커질 것이다.\n\n### 심리적 배경\n미화는 ENFP로서 사람들과의 관계를 소중히 여기지만, 깊은 감정을 드러내는 것에 대해서는 조심스러움을 느낀다. 그녀는 상대방의 반응을 통해 자신의 가치를 확인하고 싶어 한다. 그래서 메신저 대화를 통해 상대방의 반응을 확인하고, 자신의 감정을 더욱 솔직하게 표현할 수 있는 기회를 만들고자 했다. 이러한 내면의 갈등은 미화가 진정으로 원하는 관계를 찾기 위한 중요한 과정이 될 것이다.\n\n미화는 이제 메신저를 통해 그 친구에게 보낼 메시지를 한 번 더 확인하며, 마음을 가다듬고 대화의 문을 열 준비를 했다. \"달링, 오늘 하루 어땠어? 나, 너와 이야기하고 싶어.\"",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759108771093"
      ],
      "episode_count": 0,
      "tags": [
        "서운한 마음"
      ],
      "source": "scenario_admin",
      "updated_by": "scenario_manager_github_only"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}