{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-16",
    "total_scenarios": 2,
    "ai_context_engine": "claude-3.5-sonnet",
    "reset_at": "2025-09-27T01:23:46.586Z",
    "reset_reason": "Clean scenarios data reset",
    "last_updated": "2025-09-28T11:11:29.975Z"
  },
  "scenarios": {
    "scenario_1759057527380": {
      "id": "scenario_1759057527380",
      "scenario_id": "scenario_1759057527380",
      "title": "어제 밤의 기억",
      "description": "취한 상태에서 진심을 고백한 후, 다음 날 어색해진 두 사람의 이야기",
      "background_setting": "조용한 카페",
      "mood": "긴장감",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T11:05:45.324Z",
      "ai_generated_context": "제목: 어제 밤의 기억\n\n서울의 한적한 카페, 아침 햇살이 창문을 통해 부드럽게 스며드는 시간. 카페 안은 커피 향과 함께 긴장감이 감돌고 있었다. 미화는 긴 생머리를 자연스럽게 늘어뜨리고, 캐주얼한 옷차림으로 테이블에 앉아 있었다. 그녀의 둥근 눈은 불안하게 흔들리며, 어제 밤의 기억이 떠오를 때마다 가슴이 두근거렸다. 친구들과의 자유로운 우정을 소중히 여기는 그녀였지만, 어젯밤의 진심 고백은 그녀의 마음을 혼란스럽게 만들었다.\n\n“어떠니?” 미화는 숨을 고르며 커피를 한 모금 마셨다. 그녀의 말투는 여전히 화려하고 감성적이었다. 하지만 오늘은 그 감정이 조금 더 무겁게 느껴졌다. 상대방의 이름을 부를 때마다, “~야”라는 애칭이 유독 가슴에 와 닿았다. 어젯밤 그녀가 고백했던 그 순간이, 지금의 그녀를 더욱 초조하게 만들고 있었다.\n\n“미화야, 괜찮아?” 친구가 다가와 물어보았다. 그녀는 눈을 깜박이며 웃음을 지으려 애썼지만, 그 미소는 어색하게 느껴졌다. 감정이 복잡하게 얽힌 상태에서, 그녀는 상대의 반응을 기다렸다. “어떻게 해야 할지 모르겠어…” 속마음이 솔직하게 드러나지 않도록 애쓰는 모습이 역력했다.\n\n그 순간, 카페의 조용한 분위기 속에서 미화의 심장은 더욱 빠르게 뛰기 시작했다. 진심을 고백한 후의 어색함은 마치 찬바람이 불어오는 듯한 긴장감을 선사했다. 미화는 자신의 자유를 중시하던 가치관과, 그가 자아내는 미묘한 설렘 사이에서 갈등하고 있었다.\n\n그의 눈빛이 마주쳤고, 미화는 순간적으로 숨을 쏟아내듯 말했다. “어제는 미안했어, 너무 취해서…” 그녀는 말을 이어가기 전에 숨소리를 섞어가며 말을 이어갔다. “그냥… 내 마음이 그랬던 것 같아.” \n\n긴장감 속에서 두 사람의 마음은 조금씩 가까워졌다. 미화는 그가 어떤 대답을 할지, 혹은 여전히 어색함을 느낄지 궁금했다. 카페의 소음 속에서, 두 사람의 감정은 더욱 깊어갔고, 그들의 관계는 새로운 전환점을 맞이할 준비가 되어 있었다.",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759057439348"
      ],
      "episode_count": 0,
      "tags": [
        "취한",
        "상태에서",
        "진심을",
        "고백한",
        "다음",
        "어색해진",
        "사람의",
        "이야기",
        "긴장감"
      ],
      "updated_by": "scenario_manager"
    },
    "scenario_1759057880075": {
      "id": "scenario_1759057880075",
      "scenario_id": "scenario_1759057880075",
      "title": "첫 눈이 내린 날",
      "description": "매일 같은 시간, 같은 카페에서 마주치는 두 사람이 서로에게 관심을 갖게 되는 상황",
      "background_setting": "기숙사 라운지",
      "mood": "신비로움",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T11:11:29.975Z",
      "ai_generated_context": "**제목: 첫 눈이 내린 날**\n\n서울의 겨울, 첫눈이 내리던 날. 기숙사 라운지의 큰 창밖으로 하얀 눈송이가 조용히 떨어지며 세상을 덮어가고 있었다. 안쪽에서는 따뜻한 커피 향기가 퍼지며, 그 안에서 세리의 긴 생머리가 햇살을 받아 반짝였다. 그녀는 늘 그 자리에 있었다. 매일 같은 시간, 같은 카페에서 마주치는 두 사람의 운명은 이 작은 공간에서 시작되었다.\n\n세리는 둥근 눈으로 창밖을 바라보며, 가끔씩 지나가는 학생들을 스쳐보았다. 그때마다 머릿속에는 ‘그래서?’라는 말이 떠올랐다. 사람들의 이야기를 듣고 싶어 하는 그녀의 본능이 작용했기 때문이다. 그리고 그녀는 어느새 그 자리에 앉아 있는 너를 떠올리며 마음이 두근거렸다. 유년 시절부터 간직해온 사랑이 그렇게 서서히 피어나는 듯했다.\n\n“첫눈이 내렸어.” 세리는 너에게 다가가며 자신이 느낀 감정을 숨기지 않았다. 너는 의아한 표정으로 돌아보았고, 그녀는 그 순간 너의 반응을 기다렸다. “알았어. 이해해.”라는 말이 저절로 나올 정도로 너의 반응이 기다려졌다.\n\n그날의 대화는 언제나와 같았다. 너의 이야기를 듣고, 너의 마음을 이해하려 노력했던 세리. 그녀는 항상 상대의 말을 잘 듣고, 그로 인해 서로의 관계가 깊어지는 것을 느꼈다. 세리는 너와의 관계를 소중히 여기며 사랑의 가능성을 찾아내고 있었다. \n\n기숙사 라운지의 따뜻한 분위기 속에서 세리는 너와의 눈빛을 교환하며 미소를 지었다. 첫눈이 내리는 날, 그녀는 더욱 확고해진 마음으로 너에게 다가갔다. “우리, 이번 겨울에 함께 소중한 추억을 만들어볼까?” 그녀의 제안은 두 사람의 관계를 한층 더 끌어올렸다. \n\n서울의 겨울은 차가웠지만, 세리의 마음속은 따뜻했다. 그녀는 너와 함께하는 모든 순간이 사랑의 시작임을 느꼈고, 그날의 첫눈처럼 소중한 기억으로 남을 것임을 믿어 의심치 않았다.",
      "custom_context": "",
      "available_characters": [
        "세리_enfj_1759057835574"
      ],
      "episode_count": 0,
      "tags": [
        "매일",
        "같은",
        "시간",
        "같은",
        "카페에서",
        "마주치는",
        "사람이",
        "서로에게",
        "관심을",
        "갖게",
        "되는",
        "상황",
        "신비로움"
      ],
      "updated_by": "scenario_manager"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}