{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-28",
    "total_scenarios": 1,
    "ai_context_engine": "gpt-4o-mini",
    "last_updated": "2025-09-28T13:09:19.050Z",
    "data_source": "github_api_only"
  },
  "scenarios": {
    "scenario_1759064947079": {
      "id": "scenario_1759064947079",
      "scenario_id": "scenario_1759064947079",
      "title": "카페의 특별한 손님",
      "description": "매일 같은 시간, 같은 카페에서 마주치는 두 사람이 서로에게 관심을 갖게 되는 상황",
      "background_setting": "벚꽃이 만발한 공원",
      "mood": "달콤함",
      "active_status": true,
      "created_date": "2025-09-28",
      "last_modified": "2025-09-28T13:09:19.050Z",
      "ai_generated_context": "**제목: 카페의 특별한 손님**\n\n봄바람이 살랑이는 벚꽃이 만발한 공원, 그 가운데 자리 잡은 작은 카페에서 미화는 매일 같은 시간, 같은 자리에서 그를 기다렸다. 카페의 창가에 앉아 따뜻한 아메리카노를 홀짝이며, 그녀의 긴 생머리가 햇빛에 반짝이는 모습은 마치 그 자체로 봄의 상징 같았다. 유혹적인 눈매로 주변을 살피며, 그녀는 오늘도 새로운 만남을 기대하고 있었다.\n\n“어, 또 여기서 만났네요.” 그가 들어서며 미소를 지었다. 미화는 그의 목소리에 귀를 기울이며, 자신감 넘치는 말투로 대답했다. “네, 이곳은 정말 매력적이에요. 당신도 이곳의 매력을 알았나 보네요.” 그녀의 목소리에는 섹시함이 묻어났고, 상대의 반응을 살피는 듯한 미소가 그를 더욱 끌어당겼다.\n\n그는 약간 당황한 듯한 표정으로 미화를 바라보았다. 그녀는 이런 반응을 즐기듯, 한층 더 매혹적인 표정을 지었다. “벚꽃이 이렇게 아름다울 때는 카페에 앉아 있는 게 가장 좋죠.” 미화의 말에 그도 고개를 끄덕였다. 둘은 자연스레 대화를 나누며 서로의 취향을 알아갔다.\n\n미화는 사랑과 가족을 중시하는 가치관을 가지고 있었다. 그렇기에 그녀는 그와의 대화에서 그가 어떤 사람인지, 어떤 가치를 중요하게 여기는지를 알고 싶어졌다. “당신은 어떤 걸 좋아해요? 사랑에 대해 어떻게 생각하나요?” 그녀의 질문에 그는 잠시 생각에 잠겼다. 미화는 그가 대답하는 동안, 그의 표정에서 느껴지는 긴장감과 설렘이 마음에 깊이 파고들었다.\n\n“사랑은…” 그가 대답을 이어가며 미화의 눈을 바라보았다. “사람을 변화시키는 힘이 있는 것 같아요. 사랑을 통해 성장할 수 있죠.” 그의 진지한 말에 미화는 심장이 두근거렸다. 그 순간, 두 사람 사이에는 미묘한 긴장감과 설렘이 흐르며, 벚꽃이 떨어지는 것처럼 자연스러운 아름다움이 펼쳐졌다.\n\n시간이 지나면서 그들은 서로에게 조금씩 더 깊이 빠져들었다. 매일 카페에서 마주치는 것이 단순한 우연이 아니라 운명처럼 느껴지기 시작했다. 미화는 사랑이 가득한 관계를 원하고 있었고, 그 또한 같은 마음일지도 모른다는 생각이 그녀의 마음을 따뜻하게 감싸주었다.\n\n벚꽃이 흩날리는 공원에서, 미화와 그 사이의 특별한 연결은 이제 시작에 불과했다.",
      "custom_context": "",
      "available_characters": [
        "미화_esfp_1759064886354"
      ],
      "episode_count": 0,
      "tags": [
        "매일",
        "같은",
        "시간",
        "같은",
        "카페에서",
        "마주치는",
        "사람이",
        "서로에게",
        "관심을",
        "갖게",
        "되는",
        "상황",
        "달콤함"
      ],
      "updated_by": "scenario_manager_github_only"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}