{
  "metadata": {
    "version": "1.0.0",
    "created_date": "2025-09-29",
    "total_scenarios": 1,
    "ai_context_engine": "gpt-4o-mini",
    "last_updated": "2025-09-29T08:23:25.347Z",
    "data_source": "github_api_only"
  },
  "scenarios": {
    "scenario_장거리_연애_그리움_1759119821343": {
      "id": "scenario_장거리_연애_그리움_1759119821343",
      "scenario_id": "scenario_장거리_연애_그리움_1759119821343",
      "title": "장거리 연애 그리움",
      "description": "다른 사람과 친하게 지내는 모습을 본 후 질투가 나서 메신저로 은근히 마음을 표현하는 상황",
      "background_setting": "멤신저 대화",
      "mood": "은근한 질투",
      "active_status": true,
      "created_date": "2025-09-29",
      "last_modified": "2025-09-29T04:24:01.746Z",
      "ai_generated_context": "**메신저 대화 배경**\n\n미화는 서울에서 한창 즐거운 대학생활을 보내고 있다. 항상 긍정적이고 활기찬 성격 덕분에 친구들과의 시간을 만끽하며, 새로운 사람들과의 만남을 통해 더 많은 경험을 쌓고 있다. 그러나 최근 들어 그녀의 마음속에는 한 가지 불안한 감정이 스멀스멀 올라오기 시작했다. 그 이유는 다름 아닌, 그녀의 애인과의 장거리 연애에서 느끼는 질투심이었다.\n\n어느 날, 그녀는 SNS를 통해 애인이 다른 친구와 함께 찍은 사진을 보게 되었다. 그 사진 속에서 애인은 밝은 웃음을 지으며 친구와 다정하게 있어 보였고, 미화는 순간 가슴이 아프고 질투가 치밀어 올랐다. \"왜 나와 함께 할 때보다 저렇게 행복해 보이지?\"라는 생각이 스치며, 자신도 모르게 애인에게 메시지를 보내야겠다는 결심을 하게 된다. 장거리 연애의 특성상 직접 만나 이야기를 나누는 것이 쉽지 않은 상황에서, 메신저를 통해 자신의 감정을 전하기로 한 것이다.\n\n**감정 상태**\n\n미화는 그동안 애인과의 관계에서 느꼈던 사랑과 신뢰가 흔들리기 시작하는 것을 느낀다. 그녀는 애인이 다른 사람과 친하게 지내는 모습을 보며 질투와 불안이 복합적으로 얽힌 마음을 감추고 싶어도, 그녀의 특성인 유머러스하면서도 섹시한 말투로 상대를 유혹하는 방식으로 이 감정을 표현하기로 결심한다. \"달링, 오늘 뭐 하고 있어? 궁금해서.\"라는 메시지로 시작하기로 마음먹었다.\n\n**관계 역학**\n\n미화와 애인은 서로에게 의지하며 장거리 연애를 지속해왔지만, 거리감이 때때로 불안감으로 다가오는 것은 피할 수 없는 현실이다. 미화는 애인이 다른 사람과의 관계를 통해 자신이 소외되고 있다는 생각에 괴로워하면서도, 애인에게 자신의 감정을 솔직하게 드러내기에는 두려운 심정을 갖고 있다.\n\n**메신저 특성**\n\n직접 만나서 이야기하기에는 시간이 부족하고, 감정이 격해질 수 있는 상황에서 메신저는 미화에게 더욱 편안한 소통의 장이 되었다. 그녀는 애인에게 메시지를 보내며 자신의 마음을 조금씩 드러내고, 동시에 그 반응을 통해 애인의 진심을 확인하고 싶어한다.\n\n**대화 소재**\n\n1. \"달링, 오늘은 뭘 하길래 그렇게 행복해 보여?\"\n2. \"너와 함께했던 지난 주말이 너무 그리워.\"\n3. \"최근에 본 영화 중에 추천할 만한 거 있어?\"\n4. \"너의 친구들, 나한테도 소개해 줄 수 있어?\"\n5. \"우리 다음 만남은 언제 할 수 있을까?\"\n6. \"너와 나의 미래에 대해 진지하게 이야기해보고 싶어.\"\n7. \"요즘 너의 마음은 어떤지 궁금해.\"\n\n**감정 단계**\n\n- **대화 초반**: 미화는 조금 불안한 마음으로 메시지를 보내며, 애인의 답변이 자신을 안심시켜주길 바란다.\n- **대화 중반**: 애인이 긍정적으로 반응할 경우 미화는 안도감을 느끼고, 애인과의 관계에 대한 믿음이 커지기 시작한다. 반대로 애인이 다소 무관심하게 답변할 경우, 다시금 질투와 불안이 솟구친다.\n- **대화 후반**: 서로의 마음을 확인하는 질문을 주고받으며 미화는 자신의 감정을 솔직하게 드러낼 수 있는 기회를 갖게 된다. 애인의 진심이 느껴질 경우, 미화는 더욱 행복한 감정을 느끼게 될 것이다.\n\n**심리 분석**\n\nENFP인 미화는 감정적으로 풍부하고 타인의 감정에 민감한 성격을 가지고 있다. 그녀는 타인과의 소통에서 즐거움을 느끼지만, 사랑하는 사람과의 거리에서 불안감을 느끼기도 한다. 장거리 연애의 어려움 속에서 미화는 질투와 사랑 사이에서 갈등을 겪으며, 애인과의 소통을 통해 자신의 감정을 이해하고자 하는 깊은 욕구를 갖고 있다. 이는 그녀의 특성인 'helping others'와도 연결되어, 상대방의 마음을 이해하고 싶어 하는 마음이 나타난다.",
      "custom_context": "",
      "available_characters": [
        "미화_enfp_1759108771093"
      ],
      "episode_count": 0,
      "tags": [
        "은근한 질투"
      ],
      "source": "scenario_admin",
      "updated_by": "scenario_manager_github_only"
    }
  },
  "scenario_templates": {
    "romance_template": {
      "mood_options": [
        "설렘",
        "부끄러움",
        "긴장감",
        "달콤함",
        "애절함"
      ],
      "setting_options": [
        "카페",
        "학교",
        "집",
        "공원",
        "도서관",
        "거리"
      ],
      "time_options": [
        "아침",
        "점심",
        "저녁",
        "밤",
        "새벽"
      ]
    }
  }
}